src/test/resources/plays/payments/get.yaml

!play
interactions:
-
  request:
    uri: /v2/payments/PAY-FRAAY8GN1HSB
    headers:
      "Content-Type": application/json
      Authorization: Basic MDEwMTAxMDEwMTAxMDEwMTAxMDEwMTAxMDEwMTAxMDE6QUJBQkFCQUJBQkFCQUJBQkFCQUJBQkFCQUJBQkFCQUJBQkFCQUJBQg==
    method: GET
  response:
    status: 200
    headers:
      "Content-Type": application/json
    body: |
      {"id":"PAY-FRAAY8GN1HSB","status":"AUTHORIZED","delayCapture":true,"amount":{"total":7300,"gross":7300,"fees":470,"refunds":0,"liquid":6830,"currency":"BRL"},"installmentCount":1,"statementDescriptor":"sualoja.com","fundingInstrument":{"creditCard":{"id":"CRC-7D197TPTPYWQ","brand":"VISA","first6":"401200","last4":"1112","store":true,"holder":{"birthdate":"1988-12-30","birthDate":"1988-12-30","taxDocument":{"type":"CPF","number":"22222222222"},"fullname":"Jose Portador da Silva"}},"method":"CREDIT_CARD"},"fees":[{"type":"TRANSACTION","amount":470}],"escrows":[{"id":"ECW-80DQ3X1YP6XK","status":"HOLD_PENDING","description":"teste de descricao","amount":7300,"createdAt":"2017-08-11T14:42:33.000-03","updatedAt":"2017-08-11T14:42:33.000-03","_links":{"self":{"href":"https://aws-sand-gapi-01c.moip.in/v2/escrows/ECW-80DQ3X1YP6XK"},"order":{"href":"https://aws-sand-gapi-01c.moip.in/v2/orders/ORD-IUWYL83HN8V4","title":"ORD-IUWYL83HN8V4"},"payment":{"href":"https://aws-sand-gapi-01c.moip.in/v2/payments/PAY-FRAAY8GN1HSB","title":"PAY-FRAAY8GN1HSB"}}}],"events":[{"type":"PAYMENT.AUTHORIZED","createdAt":"2017-08-11T14:43:47.786-03"},{"type":"PAYMENT.IN_ANALYSIS","createdAt":"2017-08-11T14:42:34.000-03"},{"type":"PAYMENT.PRE_AUTHORIZED","createdAt":"2017-08-11T14:42:34.000-03"},{"type":"PAYMENT.CREATED","createdAt":"2017-08-11T14:42:33.000-03"}],"receivers":[{"moipAccount":{"id":"MPA-8D5DBC2THF8B8","login":"teste@teste.com.br","fullname":"Jose da Silva"},"type":"PRIMARY","amount":{"total":7300,"fees":470,"refunds":0},"feePayor":true}],"_links":{"self":{"href":"https://aws-sand-gapi-01c.moip.in/v2/payments/PAY-FRAAY8GN1HSB"},"order":{"href":"https://aws-sand-gapi-01c.moip.in/v2/orders/ORD-IUWYL83HN8V4","title":"ORD-IUWYL83HN8V4"}},"createdAt":"2017-08-11T14:42:33.000-03","updatedAt":"2017-08-11T14:43:47.785-03"}
